function About() {
  return (
    <div className="about-page">
      <section className="hero-card">
        <div className="hero-text">
          

          <h1>Про компанію</h1>

          <p>
            <strong>RentHome</strong> — це сучасна онлайн-платформа для пошуку та оренди житла,
            створена для того, щоб зробити процес вибору квартири максимально простим, швидким та зручним.
          </p>

          <p>
            Наша мета — допомогти користувачам легко знаходити житло, яке відповідає їхнім потребам
            за ціною, розташуванням і комфортом. Ми об’єднуємо перевірені пропозиції від власників
            та агентств, щоб забезпечити безпечний і прозорий процес оренди.
          </p>

          <p><strong>На платформі RentHome ви можете:</strong></p>

          <ul>
            <li>переглядати доступні квартири з детальним описом;</li>
            <li>фільтрувати житло за ціною, кількістю кімнат і типом;</li>
            <li>бронювати обрані варіанти онлайн;</li>
            <li>переглядати свої бронювання в зручному форматі;</li>
            <li>орієнтуватися на інтерактивній мапі.</li>
          </ul>

          <p>
            Ми прагнемо зробити пошук житла комфортним і зрозумілим для кожного користувача,
            незалежно від досвіду. <strong>RentHome</strong> — це поєднання технологій,
            зручності та довіри.
          </p>
        </div>

        <div className="hero-image-wrap">
          <img
            className="hero-image"
            src="https://images.unsplash.com/photo-1628592102751-ba83b0314276?q=80&w=1397&auto=format&fit=crop"
            alt="Інтер'єр квартири"
          />
        </div>
      </section>
    </div>
  );
}

export default About;